Revit 2026 API

# StructuralSectionGeneralLZBottomFlangeLength Property

---

Bottom Flange segment length.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double BottomFlangeLength { get; set; }
```
```vb
Public Property BottomFlangeLength As Double
	Get
	Set
```
```cpp
public:
property double BottomFlangeLength {
	double get ();
	void set (double value);
}
```
```fsharp
member BottomFlangeLength : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionGeneralLZ Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace